social_net/perf_testing/data/composePost/202404261253_850_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 1866.166ms, rate sampling interval: 7340ms
  Thread calibration: mean lat.: 2128.064ms, rate sampling interval: 7323ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.28s     3.50s   14.06s    83.22%
    Req/Sec   318.75     17.95   337.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.82s 
 75.000%    4.26s 
 90.000%   13.22s 
 99.000%   14.06s 
 99.900%   14.29s 
 99.990%   14.43s 
 99.999%   14.45s 
100.000%   14.45s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2662.399     0.000000            1         1.00
    3248.127     0.100000         1326         1.11
    3424.255     0.200000         2651         1.25
    3561.471     0.300000         3966         1.43
    3694.591     0.400000         5284         1.67
    3817.471     0.500000         6599         2.00
    3887.103     0.550000         7269         2.22
    3956.735     0.600000         7916         2.50
    4046.847     0.650000         8588         2.86
    4141.055     0.700000         9234         3.33
    4263.935     0.750000         9902         4.00
    4349.951     0.775000        10233         4.44
    4493.311     0.800000        10564         5.00
    4800.511     0.825000        10884         5.71
   10805.247     0.850000        11215         6.67
   12861.439     0.875000        11544         8.00
   13074.431     0.887500        11712         8.89
   13221.887     0.900000        11883        10.00
   13336.575     0.912500        12043        11.43
   13426.687     0.925000        12213        13.33
   13516.799     0.937500        12373        16.00
   13565.951     0.943750        12454        17.78
   13615.103     0.950000        12532        20.00
   13664.255     0.956250        12619        22.86
   13721.599     0.962500        12703        26.67
   13778.943     0.968750        12787        32.00
   13811.711     0.971875        12831        35.56
   13844.479     0.975000        12862        40.00
   13893.631     0.978125        12906        45.71
   13934.591     0.981250        12961        53.33
   13959.167     0.984375        12989        64.00
   13975.551     0.985938        13006        71.11
   14008.319     0.987500        13035        80.00
   14032.895     0.989062        13049        91.43
   14073.855     0.990625        13076       106.67
   14098.431     0.992188        13093       128.00
   14106.623     0.992969        13099       142.22
   14131.199     0.993750        13111       160.00
   14139.391     0.994531        13119       182.86
   14155.775     0.995313        13130       213.33
   14172.159     0.996094        13143       256.00
   14188.543     0.996484        13149       284.44
   14196.735     0.996875        13155       320.00
   14196.735     0.997266        13155       365.71
   14204.927     0.997656        13161       426.67
   14221.311     0.998047        13166       512.00
   14237.695     0.998242        13169       568.89
   14245.887     0.998437        13172       640.00
   14254.079     0.998633        13173       731.43
   14270.463     0.998828        13177       853.33
   14295.039     0.999023        13179      1024.00
   14344.191     0.999121        13181      1137.78
   14344.191     0.999219        13181      1280.00
   14352.383     0.999316        13182      1462.86
   14368.767     0.999414        13184      1706.67
   14376.959     0.999512        13186      2048.00
   14376.959     0.999561        13186      2275.56
   14376.959     0.999609        13186      2560.00
   14385.151     0.999658        13188      2925.71
   14385.151     0.999707        13188      3413.33
   14385.151     0.999756        13188      4096.00
   14401.535     0.999780        13189      4551.11
   14401.535     0.999805        13189      5120.00
   14401.535     0.999829        13189      5851.43
   14426.111     0.999854        13190      6826.67
   14426.111     0.999878        13190      8192.00
   14426.111     0.999890        13190      9102.22
   14426.111     0.999902        13190     10240.00
   14426.111     0.999915        13190     11702.86
   14450.687     0.999927        13191     13653.33
   14450.687     1.000000        13191          inf
#[Mean    =     5276.474, StdDeviation   =     3496.674]
#[Max     =    14442.496, Total count    =        13191]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  17918 requests in 30.05s, 4.85MB read
  Non-2xx or 3xx responses: 194
Requests/sec:    596.25  
Transfer/sec:    165.41KB