social_net/perf_testing/data/composePost/202404261259_50_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 381.617ms, rate sampling interval: 1566ms
  Thread calibration: mean lat.: 407.950ms, rate sampling interval: 1751ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.35s     3.41s   10.58s    79.68%
    Req/Sec    21.09     13.03    55.00     73.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  219.01ms
 75.000%    4.28s 
 90.000%    8.18s 
 99.000%   10.58s 
 99.900%   16.11s 
 99.990%   18.02s 
 99.999%   18.02s 
100.000%   18.02s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.639     0.000000            1         1.00
      93.631     0.100000           83         1.11
     108.159     0.200000          165         1.25
     126.591     0.300000          247         1.43
     171.647     0.400000          329         1.67
     219.007     0.500000          411         2.00
     278.015     0.550000          454         2.22
     467.199     0.600000          494         2.50
    2002.943     0.650000          535         2.86
    2592.767     0.700000          576         3.33
    4276.223     0.750000          617         4.00
    4460.543     0.775000          638         4.44
    5980.159     0.800000          661         5.00
    6217.727     0.825000          679         5.71
    6443.007     0.850000          699         6.67
    8052.735     0.875000          720         8.00
    8122.367     0.887500          731         8.89
    8183.807     0.900000          740        10.00
    8351.743     0.912500          751        11.43
    8617.983     0.925000          761        13.33
   10018.815     0.937500          777        16.00
   10018.815     0.943750          777        17.78
   10027.007     0.950000          785        20.00
   10035.199     0.956250          789        22.86
   10051.583     0.962500          793        26.67
   10067.967     0.968750          797        32.00
   10174.463     0.971875          799        35.56
   10264.575     0.975000          804        40.00
   10338.303     0.978125          805        45.71
   10362.879     0.981250          808        53.33
   10412.031     0.984375          811        64.00
   10412.031     0.985938          811        71.11
   10420.223     0.987500          812        80.00
   10584.063     0.989062          814        91.43
   10960.895     0.990625          815       106.67
   12189.695     0.992188          816       128.00
   12255.231     0.992969          817       142.22
   12255.231     0.993750          817       160.00
   12451.839     0.994531          818       182.86
   14114.815     0.995313          819       213.33
   14114.815     0.996094          819       256.00
   14188.543     0.996484          820       284.44
   14188.543     0.996875          820       320.00
   14188.543     0.997266          820       365.71
   16105.471     0.997656          821       426.67
   16105.471     0.998047          821       512.00
   16105.471     0.998242          821       568.89
   16105.471     0.998437          821       640.00
   16105.471     0.998633          821       731.43
   18022.399     0.998828          822       853.33
   18022.399     1.000000          822          inf
#[Mean    =     2346.974, StdDeviation   =     3407.982]
#[Max     =    18006.016, Total count    =          822]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  977 requests in 30.05s, 279.53KB read
  Socket errors: connect 0, read 0, write 0, timeout 7
  Non-2xx or 3xx responses: 131
Requests/sec:     32.51  
Transfer/sec:      9.30KB