social_net/perf_testing/data/composePost/202404261300_150_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 128.498ms, rate sampling interval: 406ms
  Thread calibration: mean lat.: 125.979ms, rate sampling interval: 374ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   659.24ms    1.84s    9.46s    91.75%
    Req/Sec    50.30     34.14   106.00     58.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  113.66ms
 75.000%  168.45ms
 90.000%  293.89ms
 99.000%    9.46s 
 99.900%   10.03s 
 99.990%   10.08s 
 99.999%   10.08s 
100.000%   10.08s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      13.175     0.000000            1         1.00
      89.663     0.100000          204         1.11
      94.015     0.200000          406         1.25
      97.855     0.300000          608         1.43
     102.783     0.400000          812         1.67
     113.663     0.500000         1013         2.00
     120.831     0.550000         1115         2.22
     127.935     0.600000         1215         2.50
     138.751     0.650000         1318         2.86
     152.959     0.700000         1418         3.33
     168.447     0.750000         1520         4.00
     178.047     0.775000         1571         4.44
     185.983     0.800000         1620         5.00
     193.919     0.825000         1671         5.71
     212.479     0.850000         1722         6.67
     241.023     0.875000         1773         8.00
     256.639     0.887500         1798         8.89
     293.887     0.900000         1823        10.00
    1916.927     0.912500         1848        11.43
    3119.103     0.925000         1874        13.33
    4308.991     0.937500         1900        16.00
    4898.815     0.943750         1912        17.78
    5459.967     0.950000         1924        20.00
    6037.503     0.956250         1938        22.86
    6623.231     0.962500         1950        26.67
    7196.671     0.968750         1962        32.00
    7729.151     0.971875         1969        35.56
    7790.591     0.975000         1975        40.00
    8318.975     0.978125         1981        45.71
    8384.511     0.981250         1988        53.33
    8904.703     0.984375         1995        64.00
    8945.663     0.985938         1997        71.11
    8978.431     0.987500         2000        80.00
    9428.991     0.989062         2003        91.43
    9478.143     0.990625         2007       106.67
    9519.103     0.992188         2012       128.00
    9519.103     0.992969         2012       142.22
    9584.639     0.993750         2013       160.00
   10010.623     0.994531         2014       182.86
   10018.815     0.995313         2016       213.33
   10027.007     0.996094         2023       256.00
   10027.007     0.996484         2023       284.44
   10027.007     0.996875         2023       320.00
   10027.007     0.997266         2023       365.71
   10027.007     0.997656         2023       426.67
   10027.007     0.998047         2023       512.00
   10027.007     0.998242         2023       568.89
   10027.007     0.998437         2023       640.00
   10027.007     0.998633         2023       731.43
   10027.007     0.998828         2023       853.33
   10067.967     0.999023         2024      1024.00
   10067.967     0.999121         2024      1137.78
   10067.967     0.999219         2024      1280.00
   10067.967     0.999316         2024      1462.86
   10067.967     0.999414         2024      1706.67
   10084.351     0.999512         2025      2048.00
   10084.351     1.000000         2025          inf
#[Mean    =      659.243, StdDeviation   =     1836.100]
#[Max     =    10076.160, Total count    =         2025]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  3003 requests in 30.05s, 832.86KB read
  Non-2xx or 3xx responses: 17
Requests/sec:     99.93  
Transfer/sec:     27.71KB